Revit 2027 API
ParameterTypeId.WallBottomExtensionDistParam Property
 "Base Extension Distance"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallBottomExtensionDistParam { get; }
Public Shared ReadOnly Property WallBottomExtensionDistParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallBottomExtensionDistParam {
	ForgeTypeId^ get ();
}
static member WallBottomExtensionDistParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace